In [1]:
!pip install --upgrade mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\hp\anaconda3\lib\site-packages (9.1.0)

In [2]:
import mysql.connector
from mysql.connector import Error

def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            auth_plugin='mysql_native_password'  # Force use of mysql_native_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

# MySQL Password
pw = " "

# Attempt to connect to the database
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

In [7]:
db = "mysql_python"

In [3]:
#Create mysql_python 

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created sucessfully")
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = "Create database mysql_python"
create_database(connection, create_database_query)

Database created sucessfully

In [4]:
#Connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        passwd = user_password,
        database = db_name)
        print("MySQL Database connection sucessful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [5]:
#Execute SQL queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was sucessful")
    except Error as err:
        print(f"Error: '{err}'")

In [8]:
create_orders_table = """ 
create table orders(
    order_id int primary key,
    customer_name varchar(25) NOT NULL,
    product_name varchar(20) NOT NULL,
    date_ordered date,
    quantity int,
    unit_price float,
    phone_number varchar(20));
"""

#Connect to the database
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySQL Database connection sucessful
Query was sucessful

In [10]:
# Insert data

data_orders = """
insert into orders values
(101, "Steve", "Laptop", "2018-06-12", 2, 800, "343246363"),
(102, "Shane", "Headphone", "2016-11-24", 2, 500, "32535745"),
(103, "Angela", "Table", "2024-11-12", 1, 1000, "586758609"),
(104, "Travis", "Bat", "2023-11-19", 5, 4000, "7856484788");
"""

connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySQL Database connection sucessful
Query was sucessful

In [11]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [12]:
#Using the select statement

q1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL Database connection sucessful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '343246363')
(102, 'Shane', 'Headphone', datetime.date(2016, 11, 24), 2, 500.0, '32535745')
(103, 'Angela', 'Table', datetime.date(2024, 11, 12), 1, 1000.0, '586758609')
(104, 'Travis', 'Bat', datetime.date(2023, 11, 19), 5, 4000.0, '7856484788')

In [13]:
#Using the select statement

q2 = """
select customer_name, phone_number from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL Database connection sucessful
('Steve', '343246363')
('Shane', '32535745')
('Angela', '586758609')
('Travis', '7856484788')

In [14]:
#Using the select statement

q3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL Database connection sucessful
(2018,)
(2016,)
(2024,)
(2023,)

In [15]:
#Using the select statement

q4 = """
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL Database connection sucessful
(2018,)
(2016,)
(2024,)
(2023,)

In [16]:
#Using the select statement

q5 = """
select * from orders where date_ordered <= '2018-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL Database connection sucessful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '343246363')
(102, 'Shane', 'Headphone', datetime.date(2016, 11, 24), 2, 500.0, '32535745')

In [17]:
#Using the select statement

q6 = """
select * from orders where date_ordered > '2018-12-31';
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL Database connection sucessful
(103, 'Angela', 'Table', datetime.date(2024, 11, 12), 1, 1000.0, '586758609')
(104, 'Travis', 'Bat', datetime.date(2023, 11, 19), 5, 4000.0, '7856484788')

In [19]:
#Using the select statement

q7 = """
select * from orders order by unit_price desc;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySQL Database connection sucessful
(104, 'Travis', 'Bat', datetime.date(2023, 11, 19), 5, 4000.0, '7856484788')
(103, 'Angela', 'Table', datetime.date(2024, 11, 12), 1, 1000.0, '586758609')
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '343246363')
(102, 'Shane', 'Headphone', datetime.date(2016, 11, 24), 2, 500.0, '32535745')

In [21]:
import pandas as pd
from_db =[]

for result in results:
    result = list(result)
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity",
          "unit_price", "phone_number"]
df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,104,Travis,Bat,2023-11-19,5,4000.0,7856484788
1,103,Angela,Table,2024-11-12,1,1000.0,586758609
2,101,Steve,Laptop,2018-06-12,2,800.0,343246363
3,102,Shane,Headphone,2016-11-24,2,500.0,32535745

In [22]:
#Update command

update = """
update orders
set unit_price = 7000
where order_id = 101
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update)

MySQL Database connection sucessful
Query was sucessful

In [24]:
q8 = """
select * from orders where order_id = 101;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL Database connection sucessful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 7000.0, '343246363')

In [25]:
#Delete command

delete_order = """
delete from orders
where order_id = 102;
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_order)

MySQL Database connection sucessful
Query was sucessful

In [26]:
q9 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL Database connection sucessful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 7000.0, '343246363')
(103, 'Angela', 'Table', datetime.date(2024, 11, 12), 1, 1000.0, '586758609')
(104, 'Travis', 'Bat', datetime.date(2023, 11, 19), 5, 4000.0, '7856484788')